[
{"character":["Tenali Raman : MALE"],"discription":"Tenali Raman was a minister in the court of Krishnadevaraya, the ruler of Vijayanar.","dialogue":[]},
{"character":["Tenali Raman : MALE"],"discription":"He was an extremely versatile personality.","dialogue":[]},
{"character":["Tenali Raman : MALE"],"discription":"The entire kingdom always buzzed with the news of his stories and practical jokes.","dialogue":[]},
{"character":["Tenali Raman : MALE"],"discription":"He was very famous and stories of his wisdom spread beyond Vijaynagar, in cities which are a part of Karnataka and Tamil Nadu now.","dialogue":[]},
{"character":["Tenali Raman : MALE"],"discription":"A great scholar by profession, Tenali Raman also knew several languages.","dialogue":[]},
{"character":["man called Ramaya town of Vijayanagar : MALE"],"discription":"There once lived a man called Ramaya in the town of Vijayanagar.","dialogue":[]},
{"character":[],"discription":"It was believed that whoever saw the face of Ramaya the first thing in the morning, would not be able to eat anything throughout the day.","dialogue":[]},
{"character":[],"discription":"So, all the people of Vijaynagar avoided Ramaya all the time.","dialogue":[]},
{"character":["king : MALE"],"discription":"The news also reached the king’s ears.","dialogue":[]},
{"character":["king : MALE"],"discription":"He wanted to find out the truth for himself and called for Ramaya at once.","dialogue":[]},
{"character":["king : MALE"],"discription":"He made Ramaya stay at a room adjacent to his bed chamber for one night.","dialogue":[]},
{"character":["king : MALE"],"discription":"The next day, when the king woke up, he went and saw Ramaya’s face the first thing the morning.","dialogue":[]},
{"character":["king : MALE"],"discription":"Later in the afternoon, the king sat to have his lunch.","dialogue":[]},
{"character":["king : MALE"],"discription":"He was served with freshly cooked hot food.","dialogue":[]},
{"character":["king : MALE"],"discription":"As he was about to take his first bite, he noticed that there was a fly in his food.","dialogue":[]},
{"character":["king : MALE"],"discription":"He threw away the platter and ordered for fresh food.","dialogue":[]},
{"character":["king : MALE"],"discription":"But by the time the food was cooked for the second time, he was not hungry any more.","dialogue":[]},
{"character":["king : MALE","people : UNKNOWN"],"discription":"Thus, the king realized that whatever the people said were true, Ramaya was indeed jinxed.","dialogue":[]},
{"character":["king : MALE","soldiers : UNKNOWN"],"discription":"So he ordered his soldiers to hang him immediately.","dialogue":[]},
{"character":["king : MALE","soldiers : UNKNOWN"],"discription":"The soldiers did not want to hang him, but they could not go against the king’s words.","dialogue":[]},
{"character":["soldiers : UNKNOWN","Ramaya towards gallows when they met Tenali Raman on way : MALE"],"discription":"They were taking Ramaya towards the gallows, when they met Tenali Raman on the way.","dialogue":[]},
{"character":["soldiers : UNKNOWN","Tenali : UNKNOWN"],"discription":"Tenali whispered something in Ramaya’s ear and then Ramaya was whisked away by the soldiers.","dialogue":[]},
{"character":["king : MALE","soldiers : UNKNOWN","Tenali : UNKNOWN","Ramaya about last wish : MALE"],"discription":"Later, when the soldiers asked Ramaya about his last wish, he said that he wanted to send across a message to the king.","dialogue":[]},
{"character":["king : MALE","soldiers : UNKNOWN","Ramaya about last wish : MALE"],"discription":"He requested them not to hang him until he received the response of the king.","dialogue":[]},
{"character":["soldiers : UNKNOWN","Ramaya about last wish : MALE"],"discription":null,"dialogue":["1: “Go and tell the king that if it is true that anyone who sees my face in the morning loses his appetite for the day, then anyone who sees the king’s face in the morning is destined to lose his life that day. Tell him that if I am jinxed then so is he, and in fact more than me.”"]},
{"character":["king : MALE"],"discription":"The king was speechless when he heard Ramaya’s message.","dialogue":[]},
{"character":["king : MALE"],"discription":"He ordered the execution to be stopped immediately.","dialogue":[]},
{"character":["king : MALE"],"discription":"He was ashamed of his ignorance.","dialogue":[]},
{"character":["anyone town : MALE","king : MALE"],"discription":"At once he called Ramaya and offered him a lot of gifts and also requested him to not disclose this incident to anyone in the town.","dialogue":[]},
{"character":["people of Vijaynagar : UNKNOWN","man who was jinxed : MALE"],"discription":"After all, the people of Vijaynagar would not like to be ruled by a man who was jinxed.","dialogue":[]}]
