[
{"character":["king rayalu: MALE"],"discription":"One morning, King Rayalu woke up early.","dialogue":[]},
{"character":["king rayalu: MALE","guards: UNKNOWN"],"discription":"He sleepily walked out of his room and called out to the guards.","dialogue":[]},
{"character":["king rayalu: MALE","barber: MALE"],"discription":"When a guard appeared, the King ordered him to fetch the barber immediately.","dialogue":[]},
{"character":["king rayalu: MALE"],"discription":"The guard left to carry out his orders and the King returned to his room.","dialogue":[]},
{"character":[],"discription":"He sat down comfortably in an easy chair and in no time he was in deep sleep again.","dialogue":[]},
{"character":["king rayalu: MALE","barber: MALE"],"discription":"When the barber came to the King’s room, he found the King sleeping in the chair.","dialogue":[]},
{"character":["king rayalu: MALE","barber: MALE"],"discription":"He did not want to wake the King up.","dialogue":[]},
{"character":["king rayalu: MALE","barber: MALE"],"discription":"So, very quietly and expertly, he trimmed the King’s hair and shaved his beard.","dialogue":[]},
{"character":["king rayalu: MALE","barber: MALE"],"discription":"The King was still sleeping soundly when the barber completed his job and left.","dialogue":[]},
{"character":["king rayalu: MALE"],"discription":"A little while later, the King woke up.","dialogue":[]},
{"character":["king rayalu: MALE","barber: MALE"],"discription":"As he did not see the barber whom he had summoned, he got angry.","dialogue":[]},
{"character":["king rayalu: MALE","barber: MALE","attendant: MALE"],"discription":"He shouted for his attendant and told him to bring the barber to him that very instant.","dialogue":[]},
{"character":["attendant: MALE"],"discription":"The attendant rushed off to carry out his order.","dialogue":[]},
{"character":["king rayalu: MALE"],"discription":"Just then, the King happened to put his hand on his chin.","dialogue":[]},
{"character":["king rayalu: MALE"],"discription":"To his surprise, his chin felt smooth and shaved.","dialogue":[]},
{"character":["king rayalu: MALE"],"discription":"So, the King went to take a look at himself in the mirror.","dialogue":[]},
{"character":["king rayalu: MALE"],"discription":"He saw that his hair had been trimmed neatly and his beard was properly shaved.","dialogue":[]},
{"character":["king rayalu: MALE","barber: MALE"],"discription":"The King was impressed with the barber’s work.","dialogue":[]},
{"character":["king rayalu: MALE","attendant: MALE","barber: MALE"],"discription":null,"dialogue":["1: “You have done good work today.I am impressed with you.Ask for a boon and I shall grant it.”"]},
{"character":["barber: MALE"],"discription":"The barber was very happy to hear this.","dialogue":[]},
{"character":["barber: MALE"],"discription":null,"dialogue":["1: “Your Majesty, you have been so kind that my family and I have no dearth of anything.But, since long I have had just one wish—that is to become a Brahmin if Your Highness can bestow this boon upon me.”"]},
{"character":["king rayalu: MALE","barber: MALE"],"discription":null,"dialogue":["1: “If that is what you desire, it shall be fulfilled tomorrow.”"]},
{"character":["king rayalu: MALE","barber: MALE"],"discription":"The barber was overjoyed and he left the room, praising the King.","dialogue":[]},
{"character":["king rayalu: MALE","brahmins: UNKNOWN","barber: MALE"],"discription":null,"dialogue":["1: “I have promised to transform the barber to a Brahmin. You have to make sure that you carry out the transformation with all your knowledge.I will reward all of you suitably.”"]},
{"character":["brahmins: UNKNOWN"],"discription":"This news spread around the town and became a cause of great concern for the other Brahmins.","dialogue":[]},
{"character":["brahmins: UNKNOWN"],"discription":null,"dialogue":["1: “What the King is doing is not fair.It is something that goes against dharma.You cannot just transform somebody into a Brahmin. This will result in more and more people wanting to become a Brahmin.”"]},
{"character":["brahmins: UNKNOWN"],"discription":"But none of them had the courage to voice their objections openly for fear of being punished.","dialogue":[]},
{"character":["tenali raman: MALE","brahmins: UNKNOWN"],"discription":"So, they decided to go to Tenali Raman to seek a solution.","dialogue":[]},
{"character":["tenali raman: MALE","brahmins: UNKNOWN"],"discription":"Tenali listened to the whole story and assured the Brahmins that he would do his best to stop this activity.","dialogue":[]},
{"character":["king rayalu: MALE","barber: MALE","brahmins: UNKNOWN"],"discription":"The next morning, the Brahmins who were ordered by the King to change the barber’s caste, took the barber to the holy river and began the procedure of the transformation by chanting hymns and mantras.","dialogue":[]},
{"character":["king rayalu: MALE"],"discription":"The King was also sitting at a distance and supervising the proceedings.","dialogue":[]},
{"character":["king rayalu: MALE","tenali raman: MALE","black dog: UNKNOWN"],"discription":"Suddenly, the King saw that at some distance, Tenali was standing beside a black dog.","dialogue":[]},
{"character":["king rayalu: MALE","tenali raman: MALE","black dog: UNKNOWN"],"discription":"Out of curiosity, the King walked up to Tenali and asked him what he was doing with the dog.","dialogue":[]},
{"character":["tenali raman: MALE","black dog: UNKNOWN"],"discription":"Tenali replied that he was trying to transform the black dog into a white cow.","dialogue":[]},
{"character":["king rayalu: MALE"],"discription":null,"dialogue":["1: “Oh Tenali. You are such a fool! How can a dog turn into a cow by giving it a dip in holy water and chanting hymns around him?”"]},
{"character":["tenali raman: MALE"],"discription":null,"dialogue":["1: “My Lord, forgive me for being foolish. But tell me, if that barber can be transformed into a Brahmin, why can’t this black dog change to a white cow?”"]},
{"character":["tenali raman: MALE","king rayalu: MALE"],"discription":"On hearing Tenali’s words, the King realized his mistake.","dialogue":[]},
{"character":["brahmins: UNKNOWN","barber: MALE","tenali raman: MALE"],"discription":"He called the barber and told him that it was not possible to transform him into a Brahmin so he should ask for another wish.","dialogue":[]},
{"character":["king rayalu: MALE","barber: MALE"],"discription":"The barber replied respectfully that because of the King’s kindness he had plenty of everything and did not need anything.","dialogue":[]},
{"character":["king rayalu: MALE","tenali raman: MALE"],"discription":"The King appreciated Tenali’s intelligence and rewarded him for opening his eyes and stopping him from doing things against dharma.","dialogue":[]}]
